using System;
using Sungero.Core;

namespace DirRX.NNOtherProcesses.Constants
{
  public static class LrdPaymentType
  {
    /// <summary>
    /// Названия записей справочника по умолчанию.
    /// </summary>
    public static class DefaultNames
    {
      // Материальная помощь на рождение ребенка, а также усыновление детей-сирот и детей, оставшихся без попечения родителей.
      [Public]
      public const string ChildBirth = "Материальная помощь на рождение ребенка, а также усыновление детей-сирот и детей, оставшихся без попечения родителей";
      
      // Материальная помощь работнику в связи со смертью члена семьи.
      [Public]
      public const string FamilyMemberDeath = "Материальная помощь работнику в связи со смертью члена семьи";
      
      // Материальная помощь работнику при материальном ущербе в связи с экстремальной ситуацией (стихийное бедствие, пожар, авария, кража и т.п.) .
      [Public]
      public const string Emergency = "Материальная помощь работнику при материальном ущербе в связи с экстремальной ситуацией (стихийное бедствие, пожар, авария, кража и т.п.) ";
      
      // Единовременная выплата в связи с трудной жизненной ситуацией.
      [Public]
      public const string LifeOneTimePayment = "Единовременная выплата в связи с трудной жизненной ситуацией";
      
      // Единовременная материальная помощь по уходу на пенсию.
      [Public]
      public const string Retirement = "Единовременная материальная помощь по уходу на пенсию";
      
      // Материальная помощь работнику, имеющему ребенка-инвалида в возрасте до 18 лет.
      [Public]
      public const string DisabledChild = "Материальная помощь работнику, имеющему ребенка-инвалида в возрасте до 18 лет";
      
      // Материальная помощь работнику-инвалиду.
      [Public]
      public const string DisabledEmployee = "Материальная помощь работнику-инвалиду";
      
      // Материальная помощь (ежемесячная и единовременная) работникам, получившим увечье.
      [Public]
      public const string Mutilation = "Материальная помощь (ежемесячная и единовременная) работникам, получившим увечье";
      
      // Материальная помощь в исключительных случаях.
      [Public]
      public const string Other = "Материальная помощь в исключительных случаях";
    }
    
    /// <summary>
    /// Код ВО для записей справочника.
    /// </summary>
    public static class CodeVO
    {
      // Материальная помощь на рождение ребенка, а также усыновление детей-сирот и детей, оставшихся без попечения родителей.
      [Public]
      public const string ChildBirth = "3323/3373, 3391/3392, 3397/3398";
      
      // Материальная помощь работнику в связи со смертью члена семьи.
      [Public]
      public const string FamilyMemberDeath = "3324";
      
      // Материальная помощь работнику при материальном ущербе в связи с экстремальной ситуацией (стихийное бедствие, пожар, авария, кража и т.п.) .
      [Public]
      public const string Emergency = "3324";
      
      // Единовременная выплата в связи с трудной жизненной ситуацией.
      [Public]
      public const string LifeOneTimePayment = "3319";
      
      // Единовременная материальная помощь по уходу на пенсию.
      [Public]
      public const string Retirement = "3328";
      
      // Материальная помощь работнику, имеющему ребенка-инвалида в возрасте до 18 лет.
      [Public]
      public const string DisabledChild = "3334";
      
      // Материальная помощь работнику-инвалиду.
      [Public]
      public const string DisabledEmployee = "3334";
      
      // Материальная помощь (ежемесячная и единовременная) работникам, получившим увечье.
      [Public]
      public const string Mutilation = "3331";
      
      // Материальная помощь в исключительных случаях.
      [Public]
      public const string Other = "3334";
    }

    
  }
}